Public Attributes | List of all members
API_ActTranPars Struct Reference
Notifications Manager
Structure for retrieving the transformation data of the actual editing operation. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_EditCmdID  | typeID
Type of the editing operation.
bool  | topNodeStretched
For vertical stretch editing, identifies the base the vertical displacement to be added to.
API_Vector  | theDisp
Displacement vector on the x-y plane.
API_Vector  | theAxeVect
Unit vector for mirroring (the base point of the mirror axis is stored in theOrigo)
API_Coord  | theOrigo
Base coordinate for Rotate, Mirror, Stretch and Resize operations.
double  | theCosA
Cosine of the rotation angle.
double  | theSinA
Sine of the rotation angle.
double  | theDispZ
Vertical displacement for Elevate and VertStretch operations.
double  | theRatio
Ratio for the Resize operation.
API_Vector  | sectionLineDir
Cutplane line direction unit vector.
Detailed Description
Structure for retrieving the transformation data of the actual editing operation.
Remarks
For the utilization of this structure see the ACAPI_Notification_GetTranParams function.
Member Data Documentation
◆ sectionLineDir
 API_ActTranPars::sectionLineDir
Cutplane line direction unit vector.
◆ theAxeVect
 API_ActTranPars::theAxeVect
Unit vector for mirroring (the base point of the mirror axis is stored in theOrigo)
◆ theCosA
 API_ActTranPars::theCosA
Cosine of the rotation angle.
◆ theDisp
 API_ActTranPars::theDisp
Displacement vector on the x-y plane.
◆ theDispZ
 API_ActTranPars::theDispZ
Vertical displacement for Elevate and VertStretch operations.
◆ theOrigo
 API_ActTranPars::theOrigo
Base coordinate for Rotate, Mirror, Stretch and Resize operations.
◆ theRatio
 API_ActTranPars::theRatio
Ratio for the Resize operation.
◆ theSinA
 API_ActTranPars::theSinA
Sine of the rotation angle.
◆ topNodeStretched
 API_ActTranPars::topNodeStretched
For vertical stretch editing, identifies the base the vertical displacement to be added to.
◆ typeID
 API_ActTranPars::typeID
Type of the editing operation.